ilg-archived/qemu/hw/cortexm/stm32-gpio.c
/*
 * STM32 MCU - GPIO emulation.
 *
 * Copyright (c) 2015 Liviu Ionescu.
 * Copyright (c) 2010 Andre Beckus.
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along
 * with this program; if not, see <http://www.gnu.org/licenses/>.
 */

#include "hw/cortexm/stm32-gpio.h"
#include "qemu/bitops.h"
#include "hw/cortexm/helper.h"

/**
 * This file implements the STM32 GPIO device.
 *
 * The implementation is more or less complete, with interrupts ready to
 * be used by LEDs & buttons.
 *
 * A read access to the Output Data register gets the last written value
 * while in output mode (not only in Push-Pull mode as specified in the
 * ST manual.
 *
 * TODO: add a separate mask to know when in push-pull output mode.
 *
 * References:
 * - ST CD00171190.pdf, Doc ID 13902 Rev 15, "RM0008 Reference Manual,
 * STM32F101xx, STM32F102xx, STM32F103xx, STM32F105xx and STM32F107xx
 * advanced ARM®-based 32-bit MCUs"
 *
 * - Doc ID 018909 Rev 6, "ST RM0090 Reference manual,
 * STM32F405xx/07xx, STM32F415xx/17xx, STM32F42xxx and STM32F43xxx
 * advanced ARM-based 32-bit MCUs"
 *
 * - Doc ID 026448 Rev 1, "ST RM0383 Reference manual,
 * STM32F411xC/E advanced ARM-based 32-bit MCUs"
 *
 * All STM32 reference manuals available from:
 * http://www.st.com/stonline/stappl/resourceSelector/\
 * app?page=fullResourceSelector&doctype=reference_manual&FamilyID=141
 */

/* ------------------------------------------------------------------------- */

static void stm32_gpio_update_idr(STM32GPIOState *state, Object *idr,
        uint16_t new_odr);

static void stm32_gpio_set_odr_irqs(STM32GPIOState *state, uint16_t old_odr,
        uint16_t new_odr);

static void stm32_gpio_update_odr_and_idr(STM32GPIOState *state, Object *odr,
        Object *idr, uint16_t new_value);

/* ------------------------------------------------------------------------- */

// TODO: rework reference to RCC to use links.
static bool stm32_gpio_is_enabled(Object *obj)
{
#if 1
    STM32GPIOState *state = STM32_GPIO_STATE(obj);

    const STM32Capabilities *capabilities = state->capabilities;
    assert(capabilities != NULL);

    switch (capabilities->family) {
    case STM32_FAMILY_F1:

        if ((peripheral_register_read_value(state->rcc->f1.reg.apb2enr)
                & (0x4 << state->port_index)) != 0) {
            return true;
        }
        break;

    case STM32_FAMILY_F4:

        if ((peripheral_register_read_value(state->rcc->f4.reg.ahb1enr)
                & (0x1 << state->port_index)) != 0) {
            return true;
        }
        break;

    default:
        break;
    }

    return false;
#else
    return true;
#endif
}

/* ===== F1 ================================================================ */

/* STM32F1[LMHX]D, STM32F1CL */

static void stm32f1_gpio_update_dir_mask(STM32GPIOState *state, int index);

/* ------------------------------------------------------------------------- */

/* The peripheral registers have to be accessed only by words (32-bit). */

static void stm32f1_gpio_crl_post_write_callback(Object *reg, Object *periph,
        uint32_t addr, uint32_t offset, unsigned size,
        peripheral_register_t value, peripheral_register_t full_value)
{
    STM32GPIOState *state = STM32_GPIO_STATE(periph);

    stm32f1_gpio_update_dir_mask(state, 0);
}

static void stm32f1_gpio_crh_post_write_callback(Object *reg, Object *periph,
        uint32_t addr, uint32_t offset, unsigned size,
        peripheral_register_t value, peripheral_register_t full_value)
{
    STM32GPIOState *state = STM32_GPIO_STATE(periph);

    stm32f1_gpio_update_dir_mask(state, 1);
}

static void stm32f1_gpio_odr_post_write_callback(Object *reg, Object *periph,
        uint32_t addr, uint32_t offset, unsigned size,
        peripheral_register_t value, peripheral_register_t full_value)
{
    STM32GPIOState *state = STM32_GPIO_STATE(periph);

    Object *odr = state->f1.reg.odr;
    assert(odr);

    uint16_t prev_value = peripheral_register_get_raw_prev_value(odr);

    stm32_gpio_set_odr_irqs(state, prev_value, full_value);
    stm32_gpio_update_idr(state, state->f1.reg.idr, full_value);
}

static void stm32f1_gpio_bsrr_post_write_callback(Object *reg, Object *periph,
        uint32_t addr, uint32_t offset, unsigned size,
        peripheral_register_t value, peripheral_register_t full_value)
{
    STM32GPIOState *state = STM32_GPIO_STATE(periph);

    Object *odr = state->f1.reg.odr;
    assert(odr);

    /* Although 'value' is known to be 32-bits, for consistency use full_value */
    uint32_t bits_to_set = (full_value & 0x0000FFFF);
    uint32_t bits_to_reset = ((full_value >> 16) & 0x0000FFFF);

    /* Clear the BR bits and set the BS bits. */
    uint32_t new_value = (peripheral_register_get_raw_value(odr)
            & (~bits_to_reset)) | bits_to_set;
    stm32_gpio_update_odr_and_idr(state, odr, state->f1.reg.idr, new_value);
}

static void stm32f1_gpio_brr_post_write_callback(Object *reg, Object *periph,
        uint32_t addr, uint32_t offset, unsigned size,
        peripheral_register_t value, peripheral_register_t full_value)
{
    STM32GPIOState *state = STM32_GPIO_STATE(periph);

    Object *odr = state->f1.reg.odr;
    assert(odr);

    /* Although 'value' is known to be 32-bits, for consistency use full_value */
    uint32_t bits_to_reset = (full_value & 0x0000FFFF);

    /* Clear the BR bits. */
    uint32_t new_value = peripheral_register_get_raw_value(odr)
            & ~bits_to_reset;
    stm32_gpio_update_odr_and_idr(state, odr, state->f1.reg.idr, new_value);
}

