ilg-archived/qemu/hw/cortexm/stm32-gpio.c
static PeripheralInfo stm32f1_gpio_info = {
    .desc = "General-purpose I/Os (GPIO)",

    .registers = (PeripheralRegisterInfo[] ) {
                {
                    .desc = "Port configuration register low (GPIOx_CRL)",
                    .name = "crl",
                    .offset_bytes = 0x00,
                    .reset_value = 0x44444444,
                    .access_flags = PERIPHERAL_REGISTER_32BITS_WORD, },
                {
                    .desc = "Port configuration register low (GPIOx_CRH)",
                    .name = "crh",
                    .offset_bytes = 0x04,
                    .reset_value = 0x44444444,
                    .access_flags = PERIPHERAL_REGISTER_32BITS_WORD, },
                {
                    .desc = "Port input data register (GPIOx_IDR)",
                    .name = "idr",
                    .offset_bytes = 0x08,
                    .reset_value = 0x00000000,
                    .reset_mask = 0xFFFF0000,
                    .access_flags = PERIPHERAL_REGISTER_32BITS_WORD,
                    .readable_bits = 0x0000FFFF,
                    .rw_mode = REGISTER_RW_MODE_READ, },
                {
                    .desc = "Port output data register (GPIOx_ODR)",
                    .name = "odr",
                    .offset_bytes = 0x0C,
                    .reset_value = 0x00000000,
                    .access_flags = PERIPHERAL_REGISTER_32BITS_WORD,
                    .writable_bits = 0x0000FFFF,
                    .rw_mode = REGISTER_RW_MODE_WRITE, },
                {
                    .desc = "Port bit set/reset register (GPIOx_BSRR)",
                    .name = "bsrr",
                    .offset_bytes = 0x10,
                    .reset_value = 0x00000000,
                    .access_flags = PERIPHERAL_REGISTER_32BITS_WORD,
                    .writable_bits = 0xFFFFFFFF,
                    .rw_mode = REGISTER_RW_MODE_WRITE, },
                {
                    .desc = "Port bit reset register (GPIOx_BRR) ",
                    .name = "brr",
                    .offset_bytes = 0x14,
                    .reset_value = 0x00000000,
                    .access_flags = PERIPHERAL_REGISTER_32BITS_WORD,
                    .writable_bits = 0x0000FFFF,
                    .rw_mode = REGISTER_RW_MODE_WRITE, },
                {
                    .desc = "Port configuration lock register (GPIOx_LCKR)",
                    .name = "lckr",
                    .offset_bytes = 0x18,
                    .reset_value = 0x0001FFFF,
                    .access_flags = PERIPHERAL_REGISTER_32BITS_WORD,
                    .readable_bits = 0x0001FFFF,
                    .writable_bits = 0x0001FFFF, },
                { }, /**/
            } , /**/
};

static void stm32f1_gpio_create_objects(Object *obj)
{
    STM32GPIOState *state = STM32_GPIO_STATE(obj);

    peripheral_new_with_info(obj, NULL, &stm32f1_gpio_info);

    state->f1.reg.crl = cm_object_get_child_by_name(obj, "crl");
    state->f1.reg.crh = cm_object_get_child_by_name(obj, "crh");
    state->f1.reg.idr = cm_object_get_child_by_name(obj, "idr");
    state->f1.reg.odr = cm_object_get_child_by_name(obj, "odr");
    state->f1.reg.bsrr = cm_object_get_child_by_name(obj, "bsrr");
    state->f1.reg.brr = cm_object_get_child_by_name(obj, "brr");
    state->f1.reg.lckr = cm_object_get_child_by_name(obj, "lckr");
}
/* ------------------------------------------------------------------------- */

/**
 * Gets the four configuration bits for the pin from the CRL or CRH
 * register.
 */
static uint32_t stm32f1_gpio_get_pin_config(STM32GPIOState *state, unsigned pin)
{
    /*
     * Simplify extract logic by combining both 32 bit registers into
     * one 64 bit value.
     */
    uint64_t cr_64 =
            ((uint64_t) peripheral_register_get_raw_value(state->f1.reg.crh)
                    << 32)
                    | (peripheral_register_get_raw_value(state->f1.reg.crl)
                            & 0xFFFFFFFF);
    return extract64(cr_64, pin * 4, 4);
}

/**
 * Configuration bits:
 * - in input mode:
 *   00: analog mode
 *   01: floating input (reset)
 *   10: Input with pull-up/pull-down
 *   11: Reserved
 * - in output mode:
 *   00: general purpose output push-pull
 *   01: general purpose output open-drain
 *   10: alternate function output push-pull
 *   11: alternate function output open-drain
 */
static uint32_t __attribute__ ((unused)) stm32f1_gpio_get_config_bits(
        STM32GPIOState *state, unsigned pin)
{
    return (stm32f1_gpio_get_pin_config(state, pin) >> 2) & 0x3;
}

/**
 * Modes are:
 * 00: input (reset)
 * 01: output, 10 MHz
 * 10: output, 2 MHz
 * 11: output, 50 MHz
 */
static uint32_t stm32f1_gpio_get_mode_bits(STM32GPIOState *state, unsigned pin)
{
    return stm32f1_gpio_get_pin_config(state, pin) & 0x3;
}

/**
 * Update the direction mask, cached for performance reasons.
 *
 * Must be called after each CR[LH] changes.
 *
 * index == 0 - CRL
 * index == 1 - CRH
 */
static void stm32f1_gpio_update_dir_mask(STM32GPIOState *state, int index)
{
    assert((index == 0) || (index == 1));

    unsigned start_pin = index * 8;
    unsigned pin_dir;
    int pin;

    for (pin = start_pin; pin < start_pin + 8; pin++) {
        pin_dir = stm32f1_gpio_get_mode_bits(state, pin);
        /*
         * If the mode is 0, the pin is input.  Otherwise, it
         * is output.
         */
        if (pin_dir == 0) {
            state->dir_mask &= ~(1 << pin); /* Input pin */
        } else {
            state->dir_mask |= (1 << pin); /* Output pin */
        }
    }
}

/* ===== F4 ================================================================ */

/* STM32F4[01][57]xx, STM32F4[23]xxx, STM32F411xx */

uint32_t stm32f4_gpio_get_config_bits(uint32_t value, uint32_t bit);
static void stm32f4_gpio_update_dir_mask(STM32GPIOState *state);

/* ------------------------------------------------------------------------- */

static void stm32f4_gpio_moder_post_write_callback(Object *reg, Object *periph,
        uint32_t addr, uint32_t offset, unsigned size,
        peripheral_register_t value, peripheral_register_t full_value)
{
    STM32GPIOState *state = STM32_GPIO_STATE(periph);

    stm32f4_gpio_update_dir_mask(state);
}

static void stm32f4_gpio_odr_post_write_callback(Object *reg, Object *periph,
        uint32_t addr, uint32_t offset, unsigned size,
        peripheral_register_t value, peripheral_register_t full_value)
{
    STM32GPIOState *state = STM32_GPIO_STATE(periph);

    Object *odr = state->f4.reg.odr;
    assert(odr);

    uint16_t prev_value = peripheral_register_get_raw_prev_value(odr);

