ilg-archived/qemu/hw/cortexm/stm32-gpio.c
    /* 'value' may be have any size, use full_word. */
    stm32_gpio_set_odr_irqs(state, prev_value, full_value);
    stm32_gpio_update_idr(state, state->f4.reg.idr, full_value);
}

static void stm32f4_gpio_bsrr_post_write_callback(Object *reg, Object *periph,
        uint32_t addr, uint32_t offset, unsigned size,
        peripheral_register_t value, peripheral_register_t full_value)
{
    STM32GPIOState *state = STM32_GPIO_STATE(periph);

    Object *odr = state->f4.reg.odr;
    assert(odr);

    /* 'value' may be have any size, use full_word. */
    uint32_t bits_to_set = (full_value & 0x0000FFFF);
    uint32_t bits_to_reset = ((full_value >> 16) & 0x0000FFFF);

    /* Clear the BR bits and set the BS bits. */
    uint32_t new_value = (peripheral_register_get_raw_value(odr)
            & (~bits_to_reset)) | bits_to_set;
    stm32_gpio_update_odr_and_idr(state, odr, state->f4.reg.idr, new_value);
}

static PeripheralInfo stm32f4_gpio_info =
        {
            .desc = "General-purpose I/Os (GPIO)",

            .registers =
                    (PeripheralRegisterInfo[] ) {
                                {
                                    .desc =
                                            "GPIO port mode register (GPIOx_MODER)",
                                    .name = "moder",
                                    .offset_bytes = 0x00,
                                    /* 0xA8000000 for port A, 0x00000280 for port B */
                                    .reset_value = 0x00000000,
                                    .access_flags =
                                    PERIPHERAL_REGISTER_32BITS_ALL, },
                                {
                                    .desc =
                                            "GPIO port output type register (GPIOx_OTYPER)",
                                    .name = "otyper",
                                    .offset_bytes = 0x04,
                                    .reset_value = 0x00000000,
                                    .access_flags =
                                    PERIPHERAL_REGISTER_32BITS_ALL,
                                    .readable_bits = 0x0000FFFF,
                                    .writable_bits = 0x0000FFFF, },
                                {
                                    .desc =
                                            "GPIO port output speed register (GPIOx_OSPEEDR)",
                                    .name = "ospeeder",
                                    .offset_bytes = 0x08,
                                    .reset_value = 0x00000000, /* 0x0000 00C0 for port B */
                                    .access_flags =
                                    PERIPHERAL_REGISTER_32BITS_ALL, },
                                {
                                    .desc =
                                            "GPIO port pull-up/pull-down register (GPIOx_PUPDR)",
                                    .name = "pupdr",
                                    .offset_bytes = 0x0C,
                                    /* 0x640000C0 for port A, 0x00000100 for port B */
                                    .reset_value = 0x00000000,
                                    .access_flags =
                                    PERIPHERAL_REGISTER_32BITS_ALL, },
                                {
                                    .desc =
                                            "GPIO Port input data register (GPIOx_IDR)",
                                    .name = "idr",
                                    .offset_bytes = 0x10,
                                    .reset_value = 0x00000000,
                                    .reset_mask = 0xFFFF0000,
                                    .access_flags =
                                    PERIPHERAL_REGISTER_32BITS_ALL,
                                    .readable_bits = 0x0000FFFF,
                                    .rw_mode = REGISTER_RW_MODE_READ, },
                                {
                                    .desc =
                                            "GPIO Port output data register (GPIOx_ODR)",
                                    .name = "odr",
                                    .offset_bytes = 0x14,
                                    .reset_value = 0x00000000,
                                    .access_flags =
                                    PERIPHERAL_REGISTER_32BITS_ALL,
                                    .writable_bits = 0x0000FFFF,
                                    .readable_bits = 0x0000FFFF, },
                                {
                                    .desc =
                                            "GPIO Port bit set/reset register (GPIOx_BSRR) ",
                                    .name = "bsrr",
                                    .offset_bytes = 0x18,
                                    .reset_value = 0x00000000,
                                    .access_flags =
                                    PERIPHERAL_REGISTER_32BITS_ALL,
                                    .rw_mode = REGISTER_RW_MODE_WRITE, },
                                {
                                    .desc =
                                            "GPIO alternate function low register (GPIOx_AFRL)",
                                    .name = "afrl",
                                    .offset_bytes = 0x20,
                                    .reset_value = 0x00000000,
                                    .access_flags =
                                    PERIPHERAL_REGISTER_32BITS_ALL, },
                                {
                                    .desc =
                                            "GPIO alternate function low register (GPIOx_AFRH)",
                                    .name = "afrh",
                                    .offset_bytes = 0x24,
                                    .reset_value = 0x00000000,
                                    .access_flags =
                                    PERIPHERAL_REGISTER_32BITS_ALL, },
                                {
                                    .desc =
                                            "GPIO Port configuration lock register (GPIOx_LCKR)",
                                    .name = "lckr",
                                    .offset_bytes = 0x1C,
                                    .reset_value = 0x00000000,
                                    .access_flags =
                                    PERIPHERAL_REGISTER_32BITS_WORD,
                                    .readable_bits = 0x0001FFFF,
                                    .writable_bits = 0x0001FFFF, },
                                { }, /**/
                            } , /**/
        };

static void stm32f4_gpio_create_objects(Object *obj)
{
    STM32GPIOState *state = STM32_GPIO_STATE(obj);

