ilg-archived/qemu/hw/cortexm/stm32-gpio.c
    peripheral_new_with_info(obj, NULL, &stm32f4_gpio_info);

    state->f4.reg.moder = cm_object_get_child_by_name(obj, "moder");
    state->f4.reg.otyper = cm_object_get_child_by_name(obj, "otyper");
    state->f4.reg.ospeeder = cm_object_get_child_by_name(obj, "ospeeder");
    state->f4.reg.pupdr = cm_object_get_child_by_name(obj, "pupdr");
    state->f4.reg.idr = cm_object_get_child_by_name(obj, "idr");
    state->f4.reg.odr = cm_object_get_child_by_name(obj, "odr");
    state->f4.reg.bsrr = cm_object_get_child_by_name(obj, "bsrr");
    state->f4.reg.afrl = cm_object_get_child_by_name(obj, "afrl");
    state->f4.reg.afrh = cm_object_get_child_by_name(obj, "afrh");
    state->f4.reg.lckr = cm_object_get_child_by_name(obj, "lckr");
}

/* ------------------------------------------------------------------------- */

/**
 * The F4 family has more uniform configuration registers, each
 * register bit has a 2-bits slice in a register.
 */
uint32_t stm32f4_gpio_get_config_bits(uint32_t value, uint32_t bit)
{
    assert(bit < 16);
    return (value >> (bit * 2)) & 0x3;
}

static void stm32f4_gpio_update_dir_mask(STM32GPIOState *state)
{
    uint32_t moder = peripheral_register_get_raw_value(state->f4.reg.moder);

    /* Fully recompute the direction mask. */
    int bit;
    uint32_t mode;
    for (bit = 0; bit < 16; bit++) {
        mode = stm32f4_gpio_get_config_bits(moder, bit);
        /*
         * If the mode is 1, the bit is output. Otherwise, it
         * is input or has alternate functions.
         */
        if (mode == 1) {
            state->dir_mask |= (1 << bit); /* Output pin */
        } else {
            state->dir_mask &= ~(1 << bit); /* Input pin */
        }
    }
}

/* ========================================================================= */

/**
 * Write the ODR register and trigger interrupts for changed pins
 * (output only).
 *
 * The odr pointer is passed to make the function useful for other
 * families too.
 */
static void stm32_gpio_update_odr_and_idr(STM32GPIOState *state, Object *odr,
        Object *idr, uint16_t new_value)
{
    assert(odr);

    /* Preserve old value, to compute changed bits */
    uint16_t old_value = peripheral_register_get_raw_value(odr);

    /*
     * Update register value. Per documentation, the upper 16 bits
     * always read as 0, so write is used, to apply the mask.
     */
    peripheral_register_write_value(odr, new_value);

    stm32_gpio_set_odr_irqs(state, old_value, new_value);
    stm32_gpio_update_idr(state, idr, new_value);
}

static void stm32_gpio_set_odr_irqs(STM32GPIOState *state, uint16_t old_odr,
        uint16_t new_odr)
{
    /* Compute pins that changed value. */
    uint16_t changed = old_odr ^ new_odr;

    /* Filter changed pins that are outputs - do not touch input pins. */
    uint16_t changed_out = changed & state->dir_mask;

    uint16_t mask = 1;
    if (changed_out) {
        int pin;
        for (pin = 0; pin < STM32_GPIO_PIN_COUNT; pin++, mask <<= 1) {
            /*
             * If the value of this pin has changed, then update
             * the output IRQ.
             */
            if (changed_out & mask) {
                qemu_set_irq(state->out_irq[pin], (new_odr & mask) ? 1 : 0);

                /*
                 * Andre Beckus used:
                 * state->busdev.parent_obj.gpios.lh_first->out[pin]
                 *
                 * The "irq_intercept_out" command in the qtest
                 * framework overwrites the out IRQ array in the
                 * NamedGPIOList structure (via the
                 * qemu_irq_intercept_out procedure).  So we need
                 * to reference this structure directly (rather than
                 * use our local state->out_irq array) in order for
                 * the unit tests to work. This is something of a hack,
                 * but I don't have a solution yet.
                 */
            }
        }
    }
}

/**
 * For output pins, make them read back the written value.
 *
 * TODO: check if there is anything special for open-drain pins.
 */
static void stm32_gpio_update_idr(STM32GPIOState *state, Object *idr,
        uint16_t new_odr)
{
    assert(idr);

    /* Clear output bits. */
    peripheral_register_and_raw_value(idr, ~state->dir_mask);
    /* Copy output bits from ODR. */
    peripheral_register_or_raw_value(idr, (new_odr & state->dir_mask));
}

/**
 * Callback fired when a GPIO input pin changes state (based
 * on an external stimulus from the machine).
 */
static void stm32_gpio_in_irq_handler(void *opaque, int n, int level)
{
    qemu_log_function_name();

    STM32GPIOState *state = STM32_GPIO_STATE(opaque);
    unsigned pin = n;

    assert(pin < STM32_GPIO_PIN_COUNT);

    const STM32Capabilities *capabilities = state->capabilities;
    assert(capabilities != NULL);

    Object *idr;
    /* Update internal pin state. */
    switch (capabilities->family) {
    case STM32_FAMILY_F1:

        idr = state->f1.reg.idr;
        break;

    case STM32_FAMILY_F4:

        idr = state->f4.reg.idr;
        break;

    default:
        g_assert(0);
        return;
    }

    if (level == 0) {
        /* Clear the IDR bit. */
        peripheral_register_and_raw_value(idr, ~(1 << pin));
    } else {
        /* Set the IDR bit. */
        peripheral_register_or_raw_value(idr, (1 << pin));
    }

    /* Propagate the pin level to the input IRQs. */
    qemu_set_irq(state->in_irq[pin], level);
}

/* ------------------------------------------------------------------------- */

static void stm32_gpio_instance_init_callback(Object *obj)
{
    qemu_log_function_name();

    STM32GPIOState *state = STM32_GPIO_STATE(obj);

    /*
     * Initialise incoming interrupts, received from machine
     * devices, like buttons.
     */
    SysBusDevice *sbd = SYS_BUS_DEVICE(obj);
    int pin;
    for (pin = 0; pin < STM32_GPIO_PIN_COUNT; pin++) {
        sysbus_init_irq(sbd, &state->in_irq[pin]);
    }
    /* Handler for incoming interrupts */
    qdev_init_gpio_in(DEVICE(obj), stm32_gpio_in_irq_handler,
    STM32_GPIO_PIN_COUNT);

