ilg-archived/qemu/hw/cortexm/stm32-gpio.c
    /*
     * Initialise outgoing interrupts, propagated to exceptions
     * or machine devices like LEDs
     */
    qdev_init_gpio_out(DEVICE(obj), state->out_irq, STM32_GPIO_PIN_COUNT);
}

static void stm32_gpio_realize_callback(DeviceState *dev, Error **errp)
{
    qemu_log_function_name();

    /* No need to call parent realize(). */

    STM32GPIOState *state = STM32_GPIO_STATE(dev);

    const STM32Capabilities *capabilities =
    STM32_GPIO_STATE(state)->capabilities;
    assert(capabilities != NULL);

    Object *obj = OBJECT(dev);

    /* Must be defined before creating registers. */
    cm_object_property_set_int(obj, 4, "register-size-bytes");

    /* TODO: get it from MCU */
    cm_object_property_set_bool(obj, true, "is-little-endian");

    uint32_t size;
    hwaddr addr;

    switch (capabilities->family) {
    case STM32_FAMILY_F1:

        if (state->port_index > STM32_GPIO_PORT_G) {
            qemu_log_mask(LOG_GUEST_ERROR, "GPIO: Illegal GPIO port %d\n",
                    state->port_index);
            return;
        }

        size = 0x400;
        addr = 0x40010800 + (state->port_index - STM32_GPIO_PORT_A) * size;

        break;

    case STM32_FAMILY_F4:

        if (state->port_index > STM32_GPIO_PORT_K) {
            qemu_log_mask(LOG_GUEST_ERROR, "GPIO: Illegal GPIO port %d\n",
                    state->port_index);
            return;
        }

        size = 0x400;
        addr = 0x40020000 + (state->port_index - STM32_GPIO_PORT_A) * size;

        break;

    default:

        size = 0; /* This will trigger an assertion to fail. */
        addr = 0;

        break;
    }

    cm_object_property_set_int(obj, addr, "mmio-address");
    cm_object_property_set_int(obj, size, "mmio-size-bytes");

    switch (capabilities->family) {
    case STM32_FAMILY_F1:
        stm32f1_gpio_create_objects(obj);

        /* Add callbacks. */
        peripheral_register_set_post_write(state->f1.reg.crl,
                &stm32f1_gpio_crl_post_write_callback);
        peripheral_register_set_post_write(state->f1.reg.crh,
                &stm32f1_gpio_crh_post_write_callback);
        peripheral_register_set_post_write(state->f1.reg.odr,
                &stm32f1_gpio_odr_post_write_callback);
        peripheral_register_set_post_write(state->f1.reg.bsrr,
                &stm32f1_gpio_bsrr_post_write_callback);
        peripheral_register_set_post_write(state->f1.reg.brr,
                &stm32f1_gpio_brr_post_write_callback);

        break;

    case STM32_FAMILY_F4:
        stm32f4_gpio_create_objects(obj);

        /* Add callbacks. */
        peripheral_register_set_post_write(state->f4.reg.moder,
                &stm32f4_gpio_moder_post_write_callback);
        peripheral_register_set_post_write(state->f4.reg.odr,
                &stm32f4_gpio_odr_post_write_callback);
        peripheral_register_set_post_write(state->f4.reg.bsrr,
                &stm32f4_gpio_bsrr_post_write_callback);

        break;

    default:
        break;
    }

    /* Call parent realize(). */
    if (!cm_device_parent_realize(dev, errp, TYPE_STM32_GPIO)) {
        return;
    }
}

static void stm32_gpio_reset_callback(DeviceState *dev)
{
    qemu_log_function_name();

    /* No need to call parent reset(). */

    STM32GPIOState *state = STM32_GPIO_STATE(dev);

    const STM32Capabilities *capabilities =
    STM32_GPIO_STATE(state)->capabilities;

    state->dir_mask = 0;

    /* Call parent reset(). */
    cm_device_parent_reset(dev, TYPE_STM32_GPIO);

    switch (capabilities->family) {
    case STM32_FAMILY_F1:

        stm32f1_gpio_update_dir_mask(state, 0);
        stm32f1_gpio_update_dir_mask(state, 1);
        break;

    case STM32_FAMILY_F4:

        stm32f4_gpio_update_dir_mask(state);
        break;

    default:
        break;
    }
}

static Property stm32_gpio_properties[] = {
        DEFINE_PROP_INT32_TYPE("port-index", STM32GPIOState, port_index,
                STM32_GPIO_PORT_UNDEFINED, stm32_gpio_index_t),
        DEFINE_PROP_NON_VOID_PTR("rcc", STM32GPIOState, rcc, STM32RCCState *),
        DEFINE_PROP_NON_VOID_PTR("capabilities", STM32GPIOState,
                capabilities, const STM32Capabilities *),
    DEFINE_PROP_END_OF_LIST() };

static void stm32_gpio_class_init_callback(ObjectClass *klass, void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->reset = stm32_gpio_reset_callback;
    dc->realize = stm32_gpio_realize_callback;

    dc->props = stm32_gpio_properties;

    PeripheralClass *per_class = PERIPHERAL_CLASS(klass);
    per_class->is_enabled = stm32_gpio_is_enabled;
}

static const TypeInfo stm32_gpio_type_info = {
    .name = TYPE_STM32_GPIO,
    .parent = TYPE_STM32_GPIO_PARENT,
    .instance_init = stm32_gpio_instance_init_callback,
    .instance_size = sizeof(STM32GPIOState),
    .class_init = stm32_gpio_class_init_callback,
    .class_size = sizeof(STM32GPIOClass) /**/
};

static void stm32_gpio_register_types(void)
{
    type_register_static(&stm32_gpio_type_info);
}

type_init(stm32_gpio_register_types);

/* ------------------------------------------------------------------------- */
